dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxCpu_reg.h
/** \brief FBD0, CPUx Redirected Address Base Register 16 */
#define CPU2_BLK16_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FBD0u)
/** Alias (User Manual Name) for CPU2_BLK16_RABR.
* To use register names with standard convension, please use CPU2_BLK16_RABR.
*/
#define CPU2_RABR16 (CPU2_BLK16_RABR)

/** \brief FBD4, CPUx Overlay Target Address Register 16 */
#define CPU2_BLK16_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FBD4u)
/** Alias (User Manual Name) for CPU2_BLK16_OTAR.
* To use register names with standard convension, please use CPU2_BLK16_OTAR.
*/
#define CPU2_OTAR16 (CPU2_BLK16_OTAR)

/** \brief FBD8, CPUx Overlay Mask Register 16 */
#define CPU2_BLK16_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FBD8u)
/** Alias (User Manual Name) for CPU2_BLK16_OMASK.
* To use register names with standard convension, please use CPU2_BLK16_OMASK.
*/
#define CPU2_OMASK16 (CPU2_BLK16_OMASK)

/** \brief FBDC, CPUx Redirected Address Base Register 17 */
#define CPU2_BLK17_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FBDCu)
/** Alias (User Manual Name) for CPU2_BLK17_RABR.
* To use register names with standard convension, please use CPU2_BLK17_RABR.
*/
#define CPU2_RABR17 (CPU2_BLK17_RABR)

/** \brief FBE0, CPUx Overlay Target Address Register 17 */
#define CPU2_BLK17_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FBE0u)
/** Alias (User Manual Name) for CPU2_BLK17_OTAR.
* To use register names with standard convension, please use CPU2_BLK17_OTAR.
*/
#define CPU2_OTAR17 (CPU2_BLK17_OTAR)

/** \brief FBE4, CPUx Overlay Mask Register 17 */
#define CPU2_BLK17_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FBE4u)
/** Alias (User Manual Name) for CPU2_BLK17_OMASK.
* To use register names with standard convension, please use CPU2_BLK17_OMASK.
*/
#define CPU2_OMASK17 (CPU2_BLK17_OMASK)

/** \brief FBE8, CPUx Redirected Address Base Register 18 */
#define CPU2_BLK18_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FBE8u)
/** Alias (User Manual Name) for CPU2_BLK18_RABR.
* To use register names with standard convension, please use CPU2_BLK18_RABR.
*/
#define CPU2_RABR18 (CPU2_BLK18_RABR)

/** \brief FBEC, CPUx Overlay Target Address Register 18 */
#define CPU2_BLK18_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FBECu)
/** Alias (User Manual Name) for CPU2_BLK18_OTAR.
* To use register names with standard convension, please use CPU2_BLK18_OTAR.
*/
#define CPU2_OTAR18 (CPU2_BLK18_OTAR)

/** \brief FBF0, CPUx Overlay Mask Register 18 */
#define CPU2_BLK18_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FBF0u)
/** Alias (User Manual Name) for CPU2_BLK18_OMASK.
* To use register names with standard convension, please use CPU2_BLK18_OMASK.
*/
#define CPU2_OMASK18 (CPU2_BLK18_OMASK)

/** \brief FBF4, CPUx Redirected Address Base Register 19 */
#define CPU2_BLK19_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FBF4u)
/** Alias (User Manual Name) for CPU2_BLK19_RABR.
* To use register names with standard convension, please use CPU2_BLK19_RABR.
*/
#define CPU2_RABR19 (CPU2_BLK19_RABR)

/** \brief FBF8, CPUx Overlay Target Address Register 19 */
#define CPU2_BLK19_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FBF8u)
/** Alias (User Manual Name) for CPU2_BLK19_OTAR.
* To use register names with standard convension, please use CPU2_BLK19_OTAR.
*/
#define CPU2_OTAR19 (CPU2_BLK19_OTAR)

/** \brief FBFC, CPUx Overlay Mask Register 19 */
#define CPU2_BLK19_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FBFCu)
/** Alias (User Manual Name) for CPU2_BLK19_OMASK.
* To use register names with standard convension, please use CPU2_BLK19_OMASK.
*/
#define CPU2_OMASK19 (CPU2_BLK19_OMASK)

/** \brief FC00, CPUx Redirected Address Base Register 20 */
#define CPU2_BLK20_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FC00u)
/** Alias (User Manual Name) for CPU2_BLK20_RABR.
* To use register names with standard convension, please use CPU2_BLK20_RABR.
*/
#define CPU2_RABR20 (CPU2_BLK20_RABR)

/** \brief FC04, CPUx Overlay Target Address Register 20 */
#define CPU2_BLK20_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FC04u)
/** Alias (User Manual Name) for CPU2_BLK20_OTAR.
* To use register names with standard convension, please use CPU2_BLK20_OTAR.
*/
#define CPU2_OTAR20 (CPU2_BLK20_OTAR)

/** \brief FC08, CPUx Overlay Mask Register 20 */
#define CPU2_BLK20_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FC08u)
/** Alias (User Manual Name) for CPU2_BLK20_OMASK.
* To use register names with standard convension, please use CPU2_BLK20_OMASK.
*/
#define CPU2_OMASK20 (CPU2_BLK20_OMASK)

/** \brief FC0C, CPUx Redirected Address Base Register 21 */
#define CPU2_BLK21_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FC0Cu)
/** Alias (User Manual Name) for CPU2_BLK21_RABR.
* To use register names with standard convension, please use CPU2_BLK21_RABR.
*/
#define CPU2_RABR21 (CPU2_BLK21_RABR)

/** \brief FC10, CPUx Overlay Target Address Register 21 */
#define CPU2_BLK21_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FC10u)
/** Alias (User Manual Name) for CPU2_BLK21_OTAR.
* To use register names with standard convension, please use CPU2_BLK21_OTAR.
*/
#define CPU2_OTAR21 (CPU2_BLK21_OTAR)

/** \brief FC14, CPUx Overlay Mask Register 21 */
#define CPU2_BLK21_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FC14u)
/** Alias (User Manual Name) for CPU2_BLK21_OMASK.
* To use register names with standard convension, please use CPU2_BLK21_OMASK.
*/
#define CPU2_OMASK21 (CPU2_BLK21_OMASK)

/** \brief FC18, CPUx Redirected Address Base Register 22 */
#define CPU2_BLK22_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FC18u)
/** Alias (User Manual Name) for CPU2_BLK22_RABR.
* To use register names with standard convension, please use CPU2_BLK22_RABR.
*/
#define CPU2_RABR22 (CPU2_BLK22_RABR)

/** \brief FC1C, CPUx Overlay Target Address Register 22 */
#define CPU2_BLK22_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FC1Cu)
/** Alias (User Manual Name) for CPU2_BLK22_OTAR.
* To use register names with standard convension, please use CPU2_BLK22_OTAR.
*/
#define CPU2_OTAR22 (CPU2_BLK22_OTAR)

/** \brief FC20, CPUx Overlay Mask Register 22 */
#define CPU2_BLK22_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FC20u)
/** Alias (User Manual Name) for CPU2_BLK22_OMASK.
* To use register names with standard convension, please use CPU2_BLK22_OMASK.
*/
#define CPU2_OMASK22 (CPU2_BLK22_OMASK)

/** \brief FC24, CPUx Redirected Address Base Register 23 */
#define CPU2_BLK23_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FC24u)
/** Alias (User Manual Name) for CPU2_BLK23_RABR.
* To use register names with standard convension, please use CPU2_BLK23_RABR.
*/
#define CPU2_RABR23 (CPU2_BLK23_RABR)

/** \brief FC28, CPUx Overlay Target Address Register 23 */
#define CPU2_BLK23_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FC28u)
/** Alias (User Manual Name) for CPU2_BLK23_OTAR.
* To use register names with standard convension, please use CPU2_BLK23_OTAR.
*/
#define CPU2_OTAR23 (CPU2_BLK23_OTAR)

/** \brief FC2C, CPUx Overlay Mask Register 23 */
#define CPU2_BLK23_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FC2Cu)
/** Alias (User Manual Name) for CPU2_BLK23_OMASK.
* To use register names with standard convension, please use CPU2_BLK23_OMASK.
*/
#define CPU2_OMASK23 (CPU2_BLK23_OMASK)

/** \brief FC30, CPUx Redirected Address Base Register 24 */
#define CPU2_BLK24_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF884FC30u)
/** Alias (User Manual Name) for CPU2_BLK24_RABR.
* To use register names with standard convension, please use CPU2_BLK24_RABR.
*/
#define CPU2_RABR24 (CPU2_BLK24_RABR)

/** \brief FC34, CPUx Overlay Target Address Register 24 */
#define CPU2_BLK24_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF884FC34u)
/** Alias (User Manual Name) for CPU2_BLK24_OTAR.
* To use register names with standard convension, please use CPU2_BLK24_OTAR.
*/
#define CPU2_OTAR24 (CPU2_BLK24_OTAR)

/** \brief FC38, CPUx Overlay Mask Register 24 */
#define CPU2_BLK24_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF884FC38u)
/** Alias (User Manual Name) for CPU2_BLK24_OMASK.
* To use register names with standard convension, please use CPU2_BLK24_OMASK.
*/
#define CPU2_OMASK24 (CPU2_BLK24_OMASK)

